test/xml/MuticastProbeSample_NVR8432-P16.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
	xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xop="http://www.w3.org/2004/08/xop/include"
	xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:tns="http://schemas.xmlsoap.org/ws/2005/04/discovery"
	xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
	xmlns:wsa5="http://www.w3.org/2005/08/addressing">
	<SOAP-ENV:Header>
		<AppSequence MessageNumber="15946" InstanceId="1"></AppSequence>
		<wsa:MessageID>15946</wsa:MessageID>
		<wsa:RelatesTo>uuid:0ca4c6e7-f6a7-400a-877a-ab0cb39f1fdc</wsa:RelatesTo>
		<wsa:To SOAP-ENV:mustUnderstand="true">urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
		<wsa:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tns:ProbeMatches>
			<tns:ProbeMatch>
				<wsa:EndpointReference>
					<wsa:Address>urn:uuid:00010010-0001-1020-8000-e4f14c1a0263</wsa:Address>
				</wsa:EndpointReference>
				<tns:Types>dn:NetworkVideoTransmitter</tns:Types>
				<tns:Scopes>onvif://www.onvif.org/register_status onvif://www.onvif.org/register_server onvif://www.onvif.org/regist_id onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/type/audio_encoder onvif://www.onvif.org/type/Net_Video_Recorder onvif://www.onvif.org/location/country/ onvif://www.onvif.org/hardware/NVR8432-P16 onvif://www.onvif.org/name/NVR8432-P16 onvif://www.onvif.org/manufacturer/NONE onvif://www.onvif.org/version/NVR-B3111.27.45.C11710.191111 onvif://www.onvif.org/serial/210235X0BU3198000006 onvif://www.onvif.org/macaddr/e4f14c1a0263 onvif://www.onvif.org/VideoSourceNumber/32 </tns:Scopes>
				<tns:XAddrs>http://192.168.1.40:85/onvif/device_service</tns:XAddrs>
				<tns:MetadataVersion>1</tns:MetadataVersion>
			</tns:ProbeMatch>
		</tns:ProbeMatches>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>